# INVALID: `severity_id` must be a value from SeverityIdEnum
# (UNKNOWN, INFORMATIONAL, LOW, MEDIUM, HIGH, CRITICAL, FATAL, OTHER).
# "EXTREME" is not permissible.
class_uid: BASE_EVENT
category_uid: UNCATEGORIZED
activity_id: UNKNOWN
type_uid: 0
severity_id: EXTREME
time: 1700000000000
metadata:
  version: "1.4.0"
  product:
    name: TestProduct
cloud:
  provider: aws
osint:
  - type_id: HOSTNAME
    value: example.com
